
set sdc_version 1.4
set_operating_conditions -max WORST

set_ungroup [get_cell I_ALU] false
set_ungroup [get_cell I_STACK_TOP] false
set_ungroup [get_cell I_REG_FILE] false
create_clock -period 2.0 -waveform {0 1.0} [get_ports {Clk}]
set_input_delay 1 -max -fall -clock "Clk" [get_ports {Instrn[0]}]
set_input_delay 1 -max -rise -clock "Clk" [get_ports {Reset}]
set_input_delay 1 -max -fall -clock "Clk" [get_ports {Reset}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {STACK_FULL}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {OUT_VALID}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {RESULT_DATA[0]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {RESULT_DATA[1]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {RESULT_DATA[2]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {RESULT_DATA[3]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {RESULT_DATA[4]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {RESULT_DATA[5]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {RESULT_DATA[6]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {RESULT_DATA[7]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {RESULT_DATA[8]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {RESULT_DATA[9]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {RESULT_DATA[10]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {RESULT_DATA[11]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {RESULT_DATA[12]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {RESULT_DATA[13]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {RESULT_DATA[14]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {RESULT_DATA[15]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Rd_Instr}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {PSW[0]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {PSW[1]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {PSW[2]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {PSW[3]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {PSW[4]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {PSW[5]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {PSW[6]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {PSW[7]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {PSW[8]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {PSW[9]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {PSW[10]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {EndOfInstrn}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[0]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[1]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[2]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[3]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[4]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[5]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[6]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[7]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[8]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[9]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[10]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[11]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[12]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[13]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[14]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[15]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[16]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[17]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[18]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[19]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[20]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[21]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[22]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[23]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[24]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[25]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[26]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[27]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[28]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[29]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[30]}]
set_output_delay 1 -max -fall -clock "Clk" [get_ports {Xecutng_Instrn[31]}]
set_clock_uncertainty  0.5 -setup [get_clocks {Clk}]
set_clock_uncertainty  0.055 -hold [get_clocks {Clk}]
set_false_path\
	-to      [get_cells {I_ALU/Neg_Flag_reg}]
set_false_path\
	-to      [get_cells {I_ALU/Zro_Flag_reg}]
